rsp-load-test-results/moderate_20250612_175446/moderate_summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: rsp-load-test.js
        output: csv (rsp-load-test-results/moderate_20250612_175446/moderate_results.csv), json (rsp-load-test-results/moderate_20250612_175446/moderate_results.json)

     scenarios: (100.00%) 1 scenario, 15 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 15 looping VUs for 5m0s over 7 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2025-06-12T17:54:47+09:00" level=info msg="Starting RSP Load Test..." source=console
time="2025-06-12T17:54:47+09:00" level=info msg="Testing zones: zone-a, zone-b, zone-c" source=console
time="2025-06-12T17:54:47+09:00" level=info msg="Zone zone-a is accessible" source=console
time="2025-06-12T17:54:47+09:00" level=info msg="Zone zone-b is accessible" source=console
time="2025-06-12T17:54:47+09:00" level=info msg="Zone zone-c is accessible" source=console

running (0m01.0s), 01/15 VUs, 1 complete and 0 interrupted iterations
default   [   0% ] 01/15 VUs  0m01.0s/5m00.0s

running (0m02.0s), 01/15 VUs, 3 complete and 0 interrupted iterations
default   [   1% ] 01/15 VUs  0m02.0s/5m00.0s

running (0m03.0s), 01/15 VUs, 4 complete and 0 interrupted iterations
default   [   1% ] 01/15 VUs  0m03.0s/5m00.0s

running (0m04.0s), 01/15 VUs, 7 complete and 0 interrupted iterations
default   [   1% ] 01/15 VUs  0m04.0s/5m00.0s

running (0m05.0s), 01/15 VUs, 9 complete and 0 interrupted iterations
default   [   2% ] 01/15 VUs  0m05.0s/5m00.0s

running (0m06.0s), 01/15 VUs, 11 complete and 0 interrupted iterations
default   [   2% ] 01/15 VUs  0m06.0s/5m00.0s

running (0m07.0s), 01/15 VUs, 12 complete and 0 interrupted iterations
default   [   2% ] 01/15 VUs  0m07.0s/5m00.0s

running (0m08.0s), 02/15 VUs, 14 complete and 0 interrupted iterations
default   [   3% ] 02/15 VUs  0m08.0s/5m00.0s

running (0m09.0s), 02/15 VUs, 19 complete and 0 interrupted iterations
default   [   3% ] 02/15 VUs  0m09.0s/5m00.0s

running (0m10.0s), 02/15 VUs, 21 complete and 0 interrupted iterations
default   [   3% ] 02/15 VUs  0m10.0s/5m00.0s

running (0m11.0s), 02/15 VUs, 24 complete and 0 interrupted iterations
default   [   4% ] 02/15 VUs  0m11.0s/5m00.0s

running (0m12.0s), 02/15 VUs, 28 complete and 0 interrupted iterations
default   [   4% ] 02/15 VUs  0m12.0s/5m00.0s

running (0m13.0s), 02/15 VUs, 30 complete and 0 interrupted iterations
default   [   4% ] 02/15 VUs  0m13.0s/5m00.0s

running (0m14.0s), 02/15 VUs, 34 complete and 0 interrupted iterations
default   [   5% ] 02/15 VUs  0m14.0s/5m00.0s

running (0m15.0s), 02/15 VUs, 39 complete and 0 interrupted iterations
default   [   5% ] 02/15 VUs  0m15.0s/5m00.0s

running (0m16.0s), 03/15 VUs, 45 complete and 0 interrupted iterations
default   [   5% ] 03/15 VUs  0m16.0s/5m00.0s

running (0m17.0s), 03/15 VUs, 50 complete and 0 interrupted iterations
default   [   6% ] 03/15 VUs  0m17.0s/5m00.0s

running (0m18.0s), 03/15 VUs, 56 complete and 0 interrupted iterations
default   [   6% ] 03/15 VUs  0m18.0s/5m00.0s

running (0m19.0s), 03/15 VUs, 61 complete and 0 interrupted iterations
default   [   6% ] 03/15 VUs  0m19.0s/5m00.0s

running (0m20.0s), 03/15 VUs, 67 complete and 0 interrupted iterations
default   [   7% ] 03/15 VUs  0m20.0s/5m00.0s

running (0m21.0s), 03/15 VUs, 74 complete and 0 interrupted iterations
default   [   7% ] 03/15 VUs  0m21.0s/5m00.0s

running (0m22.0s), 03/15 VUs, 80 complete and 0 interrupted iterations
default   [   7% ] 03/15 VUs  0m22.0s/5m00.0s

running (0m23.0s), 04/15 VUs, 85 complete and 0 interrupted iterations
default   [   8% ] 04/15 VUs  0m23.0s/5m00.0s

running (0m24.0s), 04/15 VUs, 95 complete and 0 interrupted iterations
default   [   8% ] 04/15 VUs  0m24.0s/5m00.0s

running (0m25.0s), 04/15 VUs, 102 complete and 0 interrupted iterations
default   [   8% ] 04/15 VUs  0m25.0s/5m00.0s

running (0m26.0s), 04/15 VUs, 111 complete and 0 interrupted iterations
default   [   9% ] 04/15 VUs  0m26.0s/5m00.0s

running (0m27.0s), 04/15 VUs, 118 complete and 0 interrupted iterations
default   [   9% ] 04/15 VUs  0m27.0s/5m00.0s

running (0m28.0s), 04/15 VUs, 126 complete and 0 interrupted iterations
default   [   9% ] 04/15 VUs  0m28.0s/5m00.0s

running (0m29.0s), 04/15 VUs, 133 complete and 0 interrupted iterations
default   [  10% ] 04/15 VUs  0m29.0s/5m00.0s

running (0m30.0s), 04/15 VUs, 141 complete and 0 interrupted iterations
default   [  10% ] 04/15 VUs  0m30.0s/5m00.0s

running (0m31.0s), 05/15 VUs, 151 complete and 0 interrupted iterations
default   [  10% ] 05/15 VUs  0m31.0s/5m00.0s

running (0m32.0s), 05/15 VUs, 160 complete and 0 interrupted iterations
default   [  11% ] 05/15 VUs  0m32.0s/5m00.0s

running (0m33.0s), 05/15 VUs, 170 complete and 0 interrupted iterations
default   [  11% ] 05/15 VUs  0m33.0s/5m00.0s

running (0m34.0s), 05/15 VUs, 177 complete and 0 interrupted iterations
default   [  11% ] 05/15 VUs  0m34.0s/5m00.0s

running (0m35.0s), 05/15 VUs, 187 complete and 0 interrupted iterations
default   [  12% ] 05/15 VUs  0m35.0s/5m00.0s

running (0m36.0s), 05/15 VUs, 197 complete and 0 interrupted iterations
default   [  12% ] 05/15 VUs  0m36.0s/5m00.0s

running (0m37.0s), 05/15 VUs, 209 complete and 0 interrupted iterations
default   [  12% ] 05/15 VUs  0m37.0s/5m00.0s

running (0m38.0s), 05/15 VUs, 220 complete and 0 interrupted iterations
default   [  13% ] 05/15 VUs  0m38.0s/5m00.0s

running (0m39.0s), 05/15 VUs, 229 complete and 0 interrupted iterations
default   [  13% ] 05/15 VUs  0m39.0s/5m00.0s

running (0m40.0s), 05/15 VUs, 240 complete and 0 interrupted iterations
default   [  13% ] 05/15 VUs  0m40.0s/5m00.0s

running (0m41.0s), 05/15 VUs, 251 complete and 0 interrupted iterations
default   [  14% ] 05/15 VUs  0m41.0s/5m00.0s

running (0m42.0s), 05/15 VUs, 261 complete and 0 interrupted iterations
default   [  14% ] 05/15 VUs  0m42.0s/5m00.0s

running (0m43.0s), 05/15 VUs, 271 complete and 0 interrupted iterations
default   [  14% ] 05/15 VUs  0m43.0s/5m00.0s

running (0m44.0s), 05/15 VUs, 282 complete and 0 interrupted iterations
default   [  15% ] 05/15 VUs  0m44.0s/5m00.0s

running (0m45.0s), 05/15 VUs, 294 complete and 0 interrupted iterations
default   [  15% ] 05/15 VUs  0m45.0s/5m00.0s

running (0m46.0s), 05/15 VUs, 303 complete and 0 interrupted iterations
default   [  15% ] 05/15 VUs  0m46.0s/5m00.0s

running (0m47.0s), 05/15 VUs, 311 complete and 0 interrupted iterations
default   [  16% ] 05/15 VUs  0m47.0s/5m00.0s

running (0m48.0s), 05/15 VUs, 320 complete and 0 interrupted iterations
default   [  16% ] 05/15 VUs  0m48.0s/5m00.0s

running (0m49.0s), 05/15 VUs, 332 complete and 0 interrupted iterations
default   [  16% ] 05/15 VUs  0m49.0s/5m00.0s

running (0m50.0s), 05/15 VUs, 342 complete and 0 interrupted iterations
default   [  17% ] 05/15 VUs  0m50.0s/5m00.0s

running (0m51.0s), 05/15 VUs, 354 complete and 0 interrupted iterations
default   [  17% ] 05/15 VUs  0m51.0s/5m00.0s

running (0m52.0s), 05/15 VUs, 364 complete and 0 interrupted iterations
default   [  17% ] 05/15 VUs  0m52.0s/5m00.0s

running (0m53.0s), 05/15 VUs, 374 complete and 0 interrupted iterations
default   [  18% ] 05/15 VUs  0m53.0s/5m00.0s

running (0m54.0s), 05/15 VUs, 386 complete and 0 interrupted iterations
default   [  18% ] 05/15 VUs  0m54.0s/5m00.0s

running (0m55.0s), 05/15 VUs, 394 complete and 0 interrupted iterations
default   [  18% ] 05/15 VUs  0m55.0s/5m00.0s

running (0m56.0s), 05/15 VUs, 405 complete and 0 interrupted iterations
default   [  19% ] 05/15 VUs  0m56.0s/5m00.0s

running (0m57.0s), 05/15 VUs, 415 complete and 0 interrupted iterations
default   [  19% ] 05/15 VUs  0m57.0s/5m00.0s

running (0m58.0s), 05/15 VUs, 426 complete and 0 interrupted iterations
default   [  19% ] 05/15 VUs  0m58.0s/5m00.0s

running (0m59.0s), 05/15 VUs, 436 complete and 0 interrupted iterations
default   [  20% ] 05/15 VUs  0m59.0s/5m00.0s

running (1m00.0s), 05/15 VUs, 448 complete and 0 interrupted iterations
default   [  20% ] 05/15 VUs  1m00.0s/5m00.0s

running (1m01.0s), 05/15 VUs, 455 complete and 0 interrupted iterations
default   [  20% ] 05/15 VUs  1m01.0s/5m00.0s

running (1m02.0s), 05/15 VUs, 464 complete and 0 interrupted iterations
default   [  21% ] 05/15 VUs  1m02.0s/5m00.0s

running (1m03.0s), 05/15 VUs, 473 complete and 0 interrupted iterations
default   [  21% ] 05/15 VUs  1m03.0s/5m00.0s

running (1m04.0s), 05/15 VUs, 483 complete and 0 interrupted iterations
default   [  21% ] 05/15 VUs  1m04.0s/5m00.0s

running (1m05.0s), 05/15 VUs, 494 complete and 0 interrupted iterations
default   [  22% ] 05/15 VUs  1m05.0s/5m00.0s

running (1m06.0s), 05/15 VUs, 503 complete and 0 interrupted iterations
default   [  22% ] 05/15 VUs  1m06.0s/5m00.0s

running (1m07.0s), 05/15 VUs, 515 complete and 0 interrupted iterations
default   [  22% ] 05/15 VUs  1m07.0s/5m00.0s

running (1m08.0s), 05/15 VUs, 528 complete and 0 interrupted iterations
default   [  23% ] 05/15 VUs  1m08.0s/5m00.0s

running (1m09.0s), 05/15 VUs, 537 complete and 0 interrupted iterations
default   [  23% ] 05/15 VUs  1m09.0s/5m00.0s

running (1m10.0s), 05/15 VUs, 548 complete and 0 interrupted iterations
default   [  23% ] 05/15 VUs  1m10.0s/5m00.0s

running (1m11.0s), 05/15 VUs, 558 complete and 0 interrupted iterations
default   [  24% ] 05/15 VUs  1m11.0s/5m00.0s

running (1m12.0s), 05/15 VUs, 569 complete and 0 interrupted iterations
default   [  24% ] 05/15 VUs  1m12.0s/5m00.0s

running (1m13.0s), 05/15 VUs, 578 complete and 0 interrupted iterations
default   [  24% ] 05/15 VUs  1m13.0s/5m00.0s

running (1m14.0s), 05/15 VUs, 586 complete and 0 interrupted iterations
default   [  25% ] 05/15 VUs  1m14.0s/5m00.0s

running (1m15.0s), 05/15 VUs, 598 complete and 0 interrupted iterations
default   [  25% ] 05/15 VUs  1m15.0s/5m00.0s

running (1m16.0s), 05/15 VUs, 609 complete and 0 interrupted iterations
default   [  25% ] 05/15 VUs  1m16.0s/5m00.0s

running (1m17.0s), 05/15 VUs, 616 complete and 0 interrupted iterations
default   [  26% ] 05/15 VUs  1m17.0s/5m00.0s

running (1m18.0s), 05/15 VUs, 628 complete and 0 interrupted iterations
default   [  26% ] 05/15 VUs  1m18.0s/5m00.0s

running (1m19.0s), 05/15 VUs, 641 complete and 0 interrupted iterations
default   [  26% ] 05/15 VUs  1m19.0s/5m00.0s

running (1m20.0s), 05/15 VUs, 651 complete and 0 interrupted iterations
default   [  27% ] 05/15 VUs  1m20.0s/5m00.0s

running (1m21.0s), 05/15 VUs, 661 complete and 0 interrupted iterations
default   [  27% ] 05/15 VUs  1m21.0s/5m00.0s

running (1m22.0s), 05/15 VUs, 672 complete and 0 interrupted iterations
default   [  27% ] 05/15 VUs  1m22.0s/5m00.0s

running (1m23.0s), 05/15 VUs, 683 complete and 0 interrupted iterations
default   [  28% ] 05/15 VUs  1m23.0s/5m00.0s

running (1m24.0s), 05/15 VUs, 691 complete and 0 interrupted iterations
default   [  28% ] 05/15 VUs  1m24.0s/5m00.0s

running (1m25.0s), 05/15 VUs, 699 complete and 0 interrupted iterations
default   [  28% ] 05/15 VUs  1m25.0s/5m00.0s

running (1m26.0s), 05/15 VUs, 712 complete and 0 interrupted iterations
default   [  29% ] 05/15 VUs  1m26.0s/5m00.0s

running (1m27.0s), 05/15 VUs, 723 complete and 0 interrupted iterations
default   [  29% ] 05/15 VUs  1m27.0s/5m00.0s

running (1m28.0s), 05/15 VUs, 733 complete and 0 interrupted iterations
default   [  29% ] 05/15 VUs  1m28.0s/5m00.0s

running (1m29.0s), 05/15 VUs, 742 complete and 0 interrupted iterations
default   [  30% ] 05/15 VUs  1m29.0s/5m00.0s

running (1m30.0s), 05/15 VUs, 750 complete and 0 interrupted iterations
default   [  30% ] 05/15 VUs  1m30.0s/5m00.0s

running (1m31.0s), 05/15 VUs, 760 complete and 0 interrupted iterations
default   [  30% ] 05/15 VUs  1m31.0s/5m00.0s

running (1m32.0s), 05/15 VUs, 769 complete and 0 interrupted iterations
default   [  31% ] 05/15 VUs  1m32.0s/5m00.0s

running (1m33.0s), 05/15 VUs, 779 complete and 0 interrupted iterations
default   [  31% ] 05/15 VUs  1m33.0s/5m00.0s

running (1m34.0s), 05/15 VUs, 791 complete and 0 interrupted iterations
default   [  31% ] 05/15 VUs  1m34.0s/5m00.0s

running (1m35.0s), 05/15 VUs, 799 complete and 0 interrupted iterations
default   [  32% ] 05/15 VUs  1m35.0s/5m00.0s

running (1m36.0s), 05/15 VUs, 811 complete and 0 interrupted iterations
default   [  32% ] 05/15 VUs  1m36.0s/5m00.0s

running (1m37.0s), 06/15 VUs, 822 complete and 0 interrupted iterations
default   [  32% ] 06/15 VUs  1m37.0s/5m00.0s

running (1m38.0s), 06/15 VUs, 833 complete and 0 interrupted iterations
default   [  33% ] 06/15 VUs  1m38.0s/5m00.0s

running (1m39.0s), 06/15 VUs, 846 complete and 0 interrupted iterations
default   [  33% ] 06/15 VUs  1m39.0s/5m00.0s

running (1m40.0s), 06/15 VUs, 856 complete and 0 interrupted iterations
default   [  33% ] 06/15 VUs  1m40.0s/5m00.0s

running (1m41.0s), 06/15 VUs, 869 complete and 0 interrupted iterations
default   [  34% ] 06/15 VUs  1m41.0s/5m00.0s

running (1m42.0s), 06/15 VUs, 881 complete and 0 interrupted iterations
default   [  34% ] 06/15 VUs  1m42.0s/5m00.0s

running (1m43.0s), 07/15 VUs, 895 complete and 0 interrupted iterations
default   [  34% ] 07/15 VUs  1m43.0s/5m00.0s

running (1m44.0s), 07/15 VUs, 909 complete and 0 interrupted iterations
default   [  35% ] 07/15 VUs  1m44.0s/5m00.0s

running (1m45.0s), 07/15 VUs, 925 complete and 0 interrupted iterations
default   [  35% ] 07/15 VUs  1m45.0s/5m00.0s

running (1m46.0s), 07/15 VUs, 936 complete and 0 interrupted iterations
default   [  35% ] 07/15 VUs  1m46.0s/5m00.0s

running (1m47.0s), 07/15 VUs, 950 complete and 0 interrupted iterations
default   [  36% ] 07/15 VUs  1m47.0s/5m00.0s

running (1m48.0s), 07/15 VUs, 965 complete and 0 interrupted iterations
default   [  36% ] 07/15 VUs  1m48.0s/5m00.0s

running (1m49.0s), 08/15 VUs, 981 complete and 0 interrupted iterations
default   [  36% ] 08/15 VUs  1m49.0s/5m00.0s

running (1m50.0s), 08/15 VUs, 998 complete and 0 interrupted iterations
default   [  37% ] 08/15 VUs  1m50.0s/5m00.0s

running (1m51.0s), 08/15 VUs, 1012 complete and 0 interrupted iterations
default   [  37% ] 08/15 VUs  1m51.0s/5m00.0s

running (1m52.0s), 08/15 VUs, 1031 complete and 0 interrupted iterations
default   [  37% ] 08/15 VUs  1m52.0s/5m00.0s

running (1m53.0s), 08/15 VUs, 1048 complete and 0 interrupted iterations
default   [  38% ] 08/15 VUs  1m53.0s/5m00.0s

running (1m54.0s), 08/15 VUs, 1066 complete and 0 interrupted iterations
default   [  38% ] 08/15 VUs  1m54.0s/5m00.0s

running (1m55.0s), 09/15 VUs, 1082 complete and 0 interrupted iterations
default   [  38% ] 09/15 VUs  1m55.0s/5m00.0s

running (1m56.0s), 09/15 VUs, 1099 complete and 0 interrupted iterations
default   [  39% ] 09/15 VUs  1m56.0s/5m00.0s

running (1m57.0s), 09/15 VUs, 1119 complete and 0 interrupted iterations
default   [  39% ] 09/15 VUs  1m57.0s/5m00.0s

running (1m58.0s), 09/15 VUs, 1138 complete and 0 interrupted iterations
default   [  39% ] 09/15 VUs  1m58.0s/5m00.0s

running (1m59.0s), 09/15 VUs, 1152 complete and 0 interrupted iterations
default   [  40% ] 09/15 VUs  1m59.0s/5m00.0s

running (2m00.0s), 09/15 VUs, 1165 complete and 0 interrupted iterations
default   [  40% ] 09/15 VUs  2m00.0s/5m00.0s

running (2m01.0s), 10/15 VUs, 1186 complete and 0 interrupted iterations
default   [  40% ] 10/15 VUs  2m01.0s/5m00.0s

running (2m02.0s), 10/15 VUs, 1202 complete and 0 interrupted iterations
default   [  41% ] 10/15 VUs  2m02.0s/5m00.0s

running (2m03.0s), 10/15 VUs, 1225 complete and 0 interrupted iterations
default   [  41% ] 10/15 VUs  2m03.0s/5m00.0s

running (2m04.0s), 10/15 VUs, 1245 complete and 0 interrupted iterations
default   [  41% ] 10/15 VUs  2m04.0s/5m00.0s

running (2m05.0s), 10/15 VUs, 1264 complete and 0 interrupted iterations
default   [  42% ] 10/15 VUs  2m05.0s/5m00.0s

running (2m06.0s), 10/15 VUs, 1285 complete and 0 interrupted iterations
default   [  42% ] 10/15 VUs  2m06.0s/5m00.0s

running (2m07.0s), 10/15 VUs, 1304 complete and 0 interrupted iterations
default   [  42% ] 10/15 VUs  2m07.0s/5m00.0s

running (2m08.0s), 10/15 VUs, 1322 complete and 0 interrupted iterations
default   [  43% ] 10/15 VUs  2m08.0s/5m00.0s

running (2m09.0s), 10/15 VUs, 1341 complete and 0 interrupted iterations
default   [  43% ] 10/15 VUs  2m09.0s/5m00.0s

running (2m10.0s), 10/15 VUs, 1359 complete and 0 interrupted iterations
default   [  43% ] 10/15 VUs  2m10.0s/5m00.0s

running (2m11.0s), 10/15 VUs, 1379 complete and 0 interrupted iterations
default   [  44% ] 10/15 VUs  2m11.0s/5m00.0s

running (2m12.0s), 10/15 VUs, 1399 complete and 0 interrupted iterations
default   [  44% ] 10/15 VUs  2m12.0s/5m00.0s

running (2m13.0s), 10/15 VUs, 1417 complete and 0 interrupted iterations
default   [  44% ] 10/15 VUs  2m13.0s/5m00.0s

running (2m14.0s), 10/15 VUs, 1436 complete and 0 interrupted iterations
default   [  45% ] 10/15 VUs  2m14.0s/5m00.0s

running (2m15.0s), 10/15 VUs, 1459 complete and 0 interrupted iterations
default   [  45% ] 10/15 VUs  2m15.0s/5m00.0s

running (2m16.0s), 10/15 VUs, 1482 complete and 0 interrupted iterations
default   [  45% ] 10/15 VUs  2m16.0s/5m00.0s

running (2m17.0s), 10/15 VUs, 1499 complete and 0 interrupted iterations
default   [  46% ] 10/15 VUs  2m17.0s/5m00.0s

running (2m18.0s), 10/15 VUs, 1521 complete and 0 interrupted iterations
default   [  46% ] 10/15 VUs  2m18.0s/5m00.0s

running (2m19.0s), 10/15 VUs, 1537 complete and 0 interrupted iterations
default   [  46% ] 10/15 VUs  2m19.0s/5m00.0s

running (2m20.0s), 10/15 VUs, 1560 complete and 0 interrupted iterations
default   [  47% ] 10/15 VUs  2m20.0s/5m00.0s

running (2m21.0s), 10/15 VUs, 1580 complete and 0 interrupted iterations
default   [  47% ] 10/15 VUs  2m21.0s/5m00.0s

running (2m22.0s), 10/15 VUs, 1596 complete and 0 interrupted iterations
default   [  47% ] 10/15 VUs  2m22.0s/5m00.0s

running (2m23.0s), 10/15 VUs, 1616 complete and 0 interrupted iterations
default   [  48% ] 10/15 VUs  2m23.0s/5m00.0s

running (2m24.0s), 10/15 VUs, 1633 complete and 0 interrupted iterations
default   [  48% ] 10/15 VUs  2m24.0s/5m00.0s

running (2m25.0s), 10/15 VUs, 1654 complete and 0 interrupted iterations
default   [  48% ] 10/15 VUs  2m25.0s/5m00.0s

running (2m26.0s), 10/15 VUs, 1673 complete and 0 interrupted iterations
default   [  49% ] 10/15 VUs  2m26.0s/5m00.0s

running (2m27.0s), 10/15 VUs, 1696 complete and 0 interrupted iterations
default   [  49% ] 10/15 VUs  2m27.0s/5m00.0s

running (2m28.0s), 10/15 VUs, 1715 complete and 0 interrupted iterations
default   [  49% ] 10/15 VUs  2m28.0s/5m00.0s

running (2m29.0s), 10/15 VUs, 1732 complete and 0 interrupted iterations
default   [  50% ] 10/15 VUs  2m29.0s/5m00.0s

running (2m30.0s), 10/15 VUs, 1749 complete and 0 interrupted iterations
default   [  50% ] 10/15 VUs  2m30.0s/5m00.0s

running (2m31.0s), 10/15 VUs, 1772 complete and 0 interrupted iterations
default   [  50% ] 10/15 VUs  2m31.0s/5m00.0s

running (2m32.0s), 10/15 VUs, 1790 complete and 0 interrupted iterations
default   [  51% ] 10/15 VUs  2m32.0s/5m00.0s

running (2m33.0s), 10/15 VUs, 1809 complete and 0 interrupted iterations
default   [  51% ] 10/15 VUs  2m33.0s/5m00.0s

running (2m34.0s), 10/15 VUs, 1829 complete and 0 interrupted iterations
default   [  51% ] 10/15 VUs  2m34.0s/5m00.0s

running (2m35.0s), 10/15 VUs, 1852 complete and 0 interrupted iterations
default   [  52% ] 10/15 VUs  2m35.0s/5m00.0s

running (2m36.0s), 10/15 VUs, 1870 complete and 0 interrupted iterations
default   [  52% ] 10/15 VUs  2m36.0s/5m00.0s

running (2m37.0s), 10/15 VUs, 1893 complete and 0 interrupted iterations
default   [  52% ] 10/15 VUs  2m37.0s/5m00.0s

running (2m38.0s), 10/15 VUs, 1908 complete and 0 interrupted iterations
default   [  53% ] 10/15 VUs  2m38.0s/5m00.0s

running (2m39.0s), 10/15 VUs, 1930 complete and 0 interrupted iterations
default   [  53% ] 10/15 VUs  2m39.0s/5m00.0s

running (2m40.0s), 10/15 VUs, 1949 complete and 0 interrupted iterations
default   [  53% ] 10/15 VUs  2m40.0s/5m00.0s

running (2m41.0s), 10/15 VUs, 1971 complete and 0 interrupted iterations
default   [  54% ] 10/15 VUs  2m41.0s/5m00.0s

running (2m42.0s), 10/15 VUs, 1987 complete and 0 interrupted iterations
default   [  54% ] 10/15 VUs  2m42.0s/5m00.0s

running (2m43.0s), 10/15 VUs, 2006 complete and 0 interrupted iterations
default   [  54% ] 10/15 VUs  2m43.0s/5m00.0s

running (2m44.0s), 10/15 VUs, 2024 complete and 0 interrupted iterations
default   [  55% ] 10/15 VUs  2m44.0s/5m00.0s

running (2m45.0s), 10/15 VUs, 2046 complete and 0 interrupted iterations
default   [  55% ] 10/15 VUs  2m45.0s/5m00.0s

running (2m46.0s), 10/15 VUs, 2067 complete and 0 interrupted iterations
default   [  55% ] 10/15 VUs  2m46.0s/5m00.0s

running (2m47.0s), 10/15 VUs, 2085 complete and 0 interrupted iterations
default   [  56% ] 10/15 VUs  2m47.0s/5m00.0s

running (2m48.0s), 10/15 VUs, 2106 complete and 0 interrupted iterations
default   [  56% ] 10/15 VUs  2m48.0s/5m00.0s

running (2m49.0s), 10/15 VUs, 2126 complete and 0 interrupted iterations
default   [  56% ] 10/15 VUs  2m49.0s/5m00.0s

running (2m50.0s), 10/15 VUs, 2149 complete and 0 interrupted iterations
default   [  57% ] 10/15 VUs  2m50.0s/5m00.0s

running (2m51.0s), 10/15 VUs, 2174 complete and 0 interrupted iterations
default   [  57% ] 10/15 VUs  2m51.0s/5m00.0s

running (2m52.0s), 10/15 VUs, 2197 complete and 0 interrupted iterations
default   [  57% ] 10/15 VUs  2m52.0s/5m00.0s

running (2m53.0s), 10/15 VUs, 2218 complete and 0 interrupted iterations
default   [  58% ] 10/15 VUs  2m53.0s/5m00.0s

running (2m54.0s), 10/15 VUs, 2237 complete and 0 interrupted iterations
default   [  58% ] 10/15 VUs  2m54.0s/5m00.0s

running (2m55.0s), 10/15 VUs, 2262 complete and 0 interrupted iterations
default   [  58% ] 10/15 VUs  2m55.0s/5m00.0s

running (2m56.0s), 10/15 VUs, 2283 complete and 0 interrupted iterations
default   [  59% ] 10/15 VUs  2m56.0s/5m00.0s

running (2m57.0s), 10/15 VUs, 2300 complete and 0 interrupted iterations
default   [  59% ] 10/15 VUs  2m57.0s/5m00.0s

running (2m58.0s), 10/15 VUs, 2318 complete and 0 interrupted iterations
default   [  59% ] 10/15 VUs  2m58.0s/5m00.0s

running (2m59.0s), 10/15 VUs, 2337 complete and 0 interrupted iterations
default   [  60% ] 10/15 VUs  2m59.0s/5m00.0s

running (3m00.0s), 10/15 VUs, 2358 complete and 0 interrupted iterations
default   [  60% ] 10/15 VUs  3m00.0s/5m00.0s

running (3m01.0s), 10/15 VUs, 2379 complete and 0 interrupted iterations
default   [  60% ] 10/15 VUs  3m01.0s/5m00.0s

running (3m02.0s), 10/15 VUs, 2400 complete and 0 interrupted iterations
default   [  61% ] 10/15 VUs  3m02.0s/5m00.0s

running (3m03.0s), 10/15 VUs, 2418 complete and 0 interrupted iterations
default   [  61% ] 10/15 VUs  3m03.0s/5m00.0s

running (3m04.0s), 10/15 VUs, 2440 complete and 0 interrupted iterations
default   [  61% ] 10/15 VUs  3m04.0s/5m00.0s

running (3m05.0s), 10/15 VUs, 2459 complete and 0 interrupted iterations
default   [  62% ] 10/15 VUs  3m05.0s/5m00.0s

running (3m06.0s), 10/15 VUs, 2475 complete and 0 interrupted iterations
default   [  62% ] 10/15 VUs  3m06.0s/5m00.0s

running (3m07.0s), 11/15 VUs, 2496 complete and 0 interrupted iterations
default   [  62% ] 11/15 VUs  3m07.0s/5m00.0s

running (3m08.0s), 11/15 VUs, 2517 complete and 0 interrupted iterations
default   [  63% ] 11/15 VUs  3m08.0s/5m00.0s

running (3m09.0s), 11/15 VUs, 2538 complete and 0 interrupted iterations
default   [  63% ] 11/15 VUs  3m09.0s/5m00.0s

running (3m10.0s), 11/15 VUs, 2561 complete and 0 interrupted iterations
default   [  63% ] 11/15 VUs  3m10.0s/5m00.0s

running (3m11.0s), 11/15 VUs, 2581 complete and 0 interrupted iterations
default   [  64% ] 11/15 VUs  3m11.0s/5m00.0s

running (3m12.0s), 11/15 VUs, 2601 complete and 0 interrupted iterations
default   [  64% ] 11/15 VUs  3m12.0s/5m00.0s

running (3m13.0s), 12/15 VUs, 2623 complete and 0 interrupted iterations
default   [  64% ] 12/15 VUs  3m13.0s/5m00.0s

running (3m14.0s), 12/15 VUs, 2644 complete and 0 interrupted iterations
default   [  65% ] 12/15 VUs  3m14.0s/5m00.0s

running (3m15.0s), 12/15 VUs, 2669 complete and 0 interrupted iterations
default   [  65% ] 12/15 VUs  3m15.0s/5m00.0s

running (3m16.0s), 12/15 VUs, 2689 complete and 0 interrupted iterations
default   [  65% ] 12/15 VUs  3m16.0s/5m00.0s

running (3m17.0s), 12/15 VUs, 2714 complete and 0 interrupted iterations
default   [  66% ] 12/15 VUs  3m17.0s/5m00.0s

running (3m18.0s), 12/15 VUs, 2733 complete and 0 interrupted iterations
default   [  66% ] 12/15 VUs  3m18.0s/5m00.0s

running (3m19.0s), 13/15 VUs, 2760 complete and 0 interrupted iterations
default   [  66% ] 13/15 VUs  3m19.0s/5m00.0s

running (3m20.0s), 13/15 VUs, 2784 complete and 0 interrupted iterations
default   [  67% ] 13/15 VUs  3m20.0s/5m00.0s

running (3m21.0s), 13/15 VUs, 2806 complete and 0 interrupted iterations
default   [  67% ] 13/15 VUs  3m21.0s/5m00.0s

running (3m22.0s), 13/15 VUs, 2832 complete and 0 interrupted iterations
default   [  67% ] 13/15 VUs  3m22.0s/5m00.0s

running (3m23.0s), 13/15 VUs, 2856 complete and 0 interrupted iterations
default   [  68% ] 13/15 VUs  3m23.0s/5m00.0s

running (3m24.0s), 13/15 VUs, 2882 complete and 0 interrupted iterations
default   [  68% ] 13/15 VUs  3m24.0s/5m00.0s

running (3m25.0s), 14/15 VUs, 2906 complete and 0 interrupted iterations
default   [  68% ] 14/15 VUs  3m25.0s/5m00.0s

running (3m26.0s), 14/15 VUs, 2935 complete and 0 interrupted iterations
default   [  69% ] 14/15 VUs  3m26.0s/5m00.0s

running (3m27.0s), 14/15 VUs, 2961 complete and 0 interrupted iterations
default   [  69% ] 14/15 VUs  3m27.0s/5m00.0s

running (3m28.0s), 14/15 VUs, 2989 complete and 0 interrupted iterations
default   [  69% ] 14/15 VUs  3m28.0s/5m00.0s

running (3m29.0s), 14/15 VUs, 3016 complete and 0 interrupted iterations
default   [  70% ] 14/15 VUs  3m29.0s/5m00.0s

running (3m30.0s), 14/15 VUs, 3042 complete and 0 interrupted iterations
default   [  70% ] 14/15 VUs  3m30.0s/5m00.0s

running (3m31.0s), 15/15 VUs, 3070 complete and 0 interrupted iterations
default   [  70% ] 15/15 VUs  3m31.0s/5m00.0s

running (3m32.0s), 15/15 VUs, 3100 complete and 0 interrupted iterations
default   [  71% ] 15/15 VUs  3m32.0s/5m00.0s

running (3m33.0s), 15/15 VUs, 3128 complete and 0 interrupted iterations
default   [  71% ] 15/15 VUs  3m33.0s/5m00.0s

running (3m34.0s), 15/15 VUs, 3155 complete and 0 interrupted iterations
default   [  71% ] 15/15 VUs  3m34.0s/5m00.0s

running (3m35.0s), 15/15 VUs, 3188 complete and 0 interrupted iterations
default   [  72% ] 15/15 VUs  3m35.0s/5m00.0s

running (3m36.0s), 15/15 VUs, 3223 complete and 0 interrupted iterations
default   [  72% ] 15/15 VUs  3m36.0s/5m00.0s

running (3m37.0s), 15/15 VUs, 3251 complete and 0 interrupted iterations
default   [  72% ] 15/15 VUs  3m37.0s/5m00.0s

running (3m38.0s), 15/15 VUs, 3282 complete and 0 interrupted iterations
default   [  73% ] 15/15 VUs  3m38.0s/5m00.0s

running (3m39.0s), 15/15 VUs, 3307 complete and 0 interrupted iterations
default   [  73% ] 15/15 VUs  3m39.0s/5m00.0s

running (3m40.0s), 15/15 VUs, 3335 complete and 0 interrupted iterations
default   [  73% ] 15/15 VUs  3m40.0s/5m00.0s

running (3m41.0s), 15/15 VUs, 3364 complete and 0 interrupted iterations
default   [  74% ] 15/15 VUs  3m41.0s/5m00.0s

running (3m42.0s), 15/15 VUs, 3390 complete and 0 interrupted iterations
default   [  74% ] 15/15 VUs  3m42.0s/5m00.0s

running (3m43.0s), 15/15 VUs, 3419 complete and 0 interrupted iterations
default   [  74% ] 15/15 VUs  3m43.0s/5m00.0s

running (3m44.0s), 15/15 VUs, 3450 complete and 0 interrupted iterations
default   [  75% ] 15/15 VUs  3m44.0s/5m00.0s

running (3m45.0s), 15/15 VUs, 3484 complete and 0 interrupted iterations
default   [  75% ] 15/15 VUs  3m45.0s/5m00.0s

running (3m46.0s), 15/15 VUs, 3515 complete and 0 interrupted iterations
default   [  75% ] 15/15 VUs  3m46.0s/5m00.0s

running (3m47.0s), 15/15 VUs, 3546 complete and 0 interrupted iterations
default   [  76% ] 15/15 VUs  3m47.0s/5m00.0s

running (3m48.0s), 15/15 VUs, 3572 complete and 0 interrupted iterations
default   [  76% ] 15/15 VUs  3m48.0s/5m00.0s

running (3m49.0s), 15/15 VUs, 3602 complete and 0 interrupted iterations
default   [  76% ] 15/15 VUs  3m49.0s/5m00.0s

running (3m50.0s), 15/15 VUs, 3629 complete and 0 interrupted iterations
default   [  77% ] 15/15 VUs  3m50.0s/5m00.0s

running (3m51.0s), 15/15 VUs, 3659 complete and 0 interrupted iterations
default   [  77% ] 15/15 VUs  3m51.0s/5m00.0s

running (3m52.0s), 15/15 VUs, 3690 complete and 0 interrupted iterations
default   [  77% ] 15/15 VUs  3m52.0s/5m00.0s

running (3m53.0s), 15/15 VUs, 3722 complete and 0 interrupted iterations
default   [  78% ] 15/15 VUs  3m53.0s/5m00.0s

running (3m54.0s), 15/15 VUs, 3753 complete and 0 interrupted iterations
default   [  78% ] 15/15 VUs  3m54.0s/5m00.0s

running (3m55.0s), 15/15 VUs, 3779 complete and 0 interrupted iterations
default   [  78% ] 15/15 VUs  3m55.0s/5m00.0s

running (3m56.0s), 15/15 VUs, 3809 complete and 0 interrupted iterations
default   [  79% ] 15/15 VUs  3m56.0s/5m00.0s

running (3m57.0s), 15/15 VUs, 3835 complete and 0 interrupted iterations
default   [  79% ] 15/15 VUs  3m57.0s/5m00.0s

running (3m58.0s), 15/15 VUs, 3869 complete and 0 interrupted iterations
default   [  79% ] 15/15 VUs  3m58.0s/5m00.0s

running (3m59.0s), 15/15 VUs, 3895 complete and 0 interrupted iterations
default   [  80% ] 15/15 VUs  3m59.0s/5m00.0s

running (4m00.0s), 15/15 VUs, 3927 complete and 0 interrupted iterations
default   [  80% ] 15/15 VUs  4m00.0s/5m00.0s

running (4m01.0s), 15/15 VUs, 3957 complete and 0 interrupted iterations
default   [  80% ] 15/15 VUs  4m01.0s/5m00.0s

running (4m02.0s), 15/15 VUs, 3985 complete and 0 interrupted iterations
default   [  81% ] 15/15 VUs  4m02.0s/5m00.0s

running (4m03.0s), 15/15 VUs, 4014 complete and 0 interrupted iterations
default   [  81% ] 15/15 VUs  4m03.0s/5m00.0s

running (4m04.0s), 15/15 VUs, 4045 complete and 0 interrupted iterations
default   [  81% ] 15/15 VUs  4m04.0s/5m00.0s

running (4m05.0s), 15/15 VUs, 4076 complete and 0 interrupted iterations
default   [  82% ] 15/15 VUs  4m05.0s/5m00.0s

running (4m06.0s), 15/15 VUs, 4108 complete and 0 interrupted iterations
default   [  82% ] 15/15 VUs  4m06.0s/5m00.0s

running (4m07.0s), 15/15 VUs, 4138 complete and 0 interrupted iterations
default   [  82% ] 15/15 VUs  4m07.0s/5m00.0s

running (4m08.0s), 15/15 VUs, 4168 complete and 0 interrupted iterations
default   [  83% ] 15/15 VUs  4m08.0s/5m00.0s

running (4m09.0s), 15/15 VUs, 4196 complete and 0 interrupted iterations
default   [  83% ] 15/15 VUs  4m09.0s/5m00.0s

running (4m10.0s), 15/15 VUs, 4227 complete and 0 interrupted iterations
default   [  83% ] 15/15 VUs  4m10.0s/5m00.0s

running (4m11.0s), 15/15 VUs, 4259 complete and 0 interrupted iterations
default   [  84% ] 15/15 VUs  4m11.0s/5m00.0s

running (4m12.0s), 15/15 VUs, 4289 complete and 0 interrupted iterations
default   [  84% ] 15/15 VUs  4m12.0s/5m00.0s

running (4m13.0s), 15/15 VUs, 4313 complete and 0 interrupted iterations
default   [  84% ] 15/15 VUs  4m13.0s/5m00.0s

running (4m14.0s), 15/15 VUs, 4342 complete and 0 interrupted iterations
default   [  85% ] 15/15 VUs  4m14.0s/5m00.0s

running (4m15.0s), 15/15 VUs, 4370 complete and 0 interrupted iterations
default   [  85% ] 15/15 VUs  4m15.0s/5m00.0s

running (4m16.0s), 15/15 VUs, 4397 complete and 0 interrupted iterations
default   [  85% ] 15/15 VUs  4m16.0s/5m00.0s

running (4m17.0s), 15/15 VUs, 4425 complete and 0 interrupted iterations
default   [  86% ] 15/15 VUs  4m17.0s/5m00.0s

running (4m18.0s), 15/15 VUs, 4458 complete and 0 interrupted iterations
default   [  86% ] 15/15 VUs  4m18.0s/5m00.0s

running (4m19.0s), 15/15 VUs, 4486 complete and 0 interrupted iterations
default   [  86% ] 15/15 VUs  4m19.0s/5m00.0s

running (4m20.0s), 15/15 VUs, 4513 complete and 0 interrupted iterations
default   [  87% ] 15/15 VUs  4m20.0s/5m00.0s

running (4m21.0s), 15/15 VUs, 4541 complete and 0 interrupted iterations
default   [  87% ] 15/15 VUs  4m21.0s/5m00.0s

running (4m22.0s), 15/15 VUs, 4572 complete and 0 interrupted iterations
default   [  87% ] 15/15 VUs  4m22.0s/5m00.0s

running (4m23.0s), 15/15 VUs, 4600 complete and 0 interrupted iterations
default   [  88% ] 15/15 VUs  4m23.0s/5m00.0s

running (4m24.0s), 15/15 VUs, 4631 complete and 0 interrupted iterations
default   [  88% ] 15/15 VUs  4m24.0s/5m00.0s

running (4m25.0s), 15/15 VUs, 4663 complete and 0 interrupted iterations
default   [  88% ] 15/15 VUs  4m25.0s/5m00.0s

running (4m26.0s), 15/15 VUs, 4692 complete and 0 interrupted iterations
default   [  89% ] 15/15 VUs  4m26.0s/5m00.0s

running (4m27.0s), 15/15 VUs, 4724 complete and 0 interrupted iterations
default   [  89% ] 15/15 VUs  4m27.0s/5m00.0s

running (4m28.0s), 15/15 VUs, 4749 complete and 0 interrupted iterations
default   [  89% ] 15/15 VUs  4m28.0s/5m00.0s

running (4m29.0s), 15/15 VUs, 4775 complete and 0 interrupted iterations
default   [  90% ] 15/15 VUs  4m29.0s/5m00.0s

running (4m30.0s), 15/15 VUs, 4808 complete and 0 interrupted iterations
default   [  90% ] 15/15 VUs  4m30.0s/5m00.0s

running (4m31.0s), 15/15 VUs, 4837 complete and 0 interrupted iterations
default   [  90% ] 15/15 VUs  4m31.0s/5m00.0s

running (4m32.0s), 15/15 VUs, 4865 complete and 0 interrupted iterations
default   [  91% ] 15/15 VUs  4m32.0s/5m00.0s

running (4m33.0s), 14/15 VUs, 4895 complete and 0 interrupted iterations
default   [  91% ] 14/15 VUs  4m33.0s/5m00.0s

running (4m34.0s), 14/15 VUs, 4922 complete and 0 interrupted iterations
default   [  91% ] 14/15 VUs  4m34.0s/5m00.0s

running (4m35.0s), 13/15 VUs, 4949 complete and 0 interrupted iterations
default   [  92% ] 13/15 VUs  4m35.0s/5m00.0s

running (4m36.0s), 13/15 VUs, 4979 complete and 0 interrupted iterations
default   [  92% ] 13/15 VUs  4m36.0s/5m00.0s

running (4m37.0s), 12/15 VUs, 5000 complete and 0 interrupted iterations
default   [  92% ] 12/15 VUs  4m37.0s/5m00.0s

running (4m38.0s), 12/15 VUs, 5028 complete and 0 interrupted iterations
default   [  93% ] 12/15 VUs  4m38.0s/5m00.0s

running (4m39.0s), 11/15 VUs, 5047 complete and 0 interrupted iterations
default   [  93% ] 11/15 VUs  4m39.0s/5m00.0s

running (4m40.0s), 11/15 VUs, 5070 complete and 0 interrupted iterations
default   [  93% ] 11/15 VUs  4m40.0s/5m00.0s

running (4m41.0s), 10/15 VUs, 5088 complete and 0 interrupted iterations
default   [  94% ] 10/15 VUs  4m41.0s/5m00.0s

running (4m42.0s), 10/15 VUs, 5110 complete and 0 interrupted iterations
default   [  94% ] 10/15 VUs  4m42.0s/5m00.0s

running (4m43.0s), 09/15 VUs, 5124 complete and 0 interrupted iterations
default   [  94% ] 09/15 VUs  4m43.0s/5m00.0s

running (4m44.0s), 09/15 VUs, 5149 complete and 0 interrupted iterations
default   [  95% ] 09/15 VUs  4m44.0s/5m00.0s

running (4m45.0s), 08/15 VUs, 5163 complete and 0 interrupted iterations
default   [  95% ] 08/15 VUs  4m45.0s/5m00.0s

running (4m46.0s), 08/15 VUs, 5179 complete and 0 interrupted iterations
default   [  95% ] 08/15 VUs  4m46.0s/5m00.0s

running (4m47.0s), 07/15 VUs, 5192 complete and 0 interrupted iterations
default   [  96% ] 07/15 VUs  4m47.0s/5m00.0s

running (4m48.0s), 07/15 VUs, 5207 complete and 0 interrupted iterations
default   [  96% ] 07/15 VUs  4m48.0s/5m00.0s

running (4m49.0s), 06/15 VUs, 5221 complete and 0 interrupted iterations
default   [  96% ] 06/15 VUs  4m49.0s/5m00.0s

running (4m50.0s), 06/15 VUs, 5231 complete and 0 interrupted iterations
default   [  97% ] 06/15 VUs  4m50.0s/5m00.0s

running (4m51.0s), 05/15 VUs, 5239 complete and 0 interrupted iterations
default   [  97% ] 05/15 VUs  4m51.0s/5m00.0s

running (4m52.0s), 05/15 VUs, 5248 complete and 0 interrupted iterations
default   [  97% ] 05/15 VUs  4m52.0s/5m00.0s

running (4m53.0s), 04/15 VUs, 5257 complete and 0 interrupted iterations
default   [  98% ] 04/15 VUs  4m53.0s/5m00.0s

running (4m54.0s), 04/15 VUs, 5265 complete and 0 interrupted iterations
default   [  98% ] 04/15 VUs  4m54.0s/5m00.0s

running (4m55.0s), 03/15 VUs, 5272 complete and 0 interrupted iterations
default   [  98% ] 03/15 VUs  4m55.0s/5m00.0s

running (4m56.0s), 03/15 VUs, 5279 complete and 0 interrupted iterations
default   [  99% ] 03/15 VUs  4m56.0s/5m00.0s

running (4m57.0s), 02/15 VUs, 5284 complete and 0 interrupted iterations
default   [  99% ] 02/15 VUs  4m57.0s/5m00.0s

running (4m58.0s), 02/15 VUs, 5288 complete and 0 interrupted iterations
default   [  99% ] 02/15 VUs  4m58.0s/5m00.0s

running (4m59.0s), 01/15 VUs, 5290 complete and 0 interrupted iterations
default   [ 100% ] 01/15 VUs  4m59.0s/5m00.0s

running (5m00.0s), 01/15 VUs, 5293 complete and 0 interrupted iterations
default   [ 100% ] 01/15 VUs  5m00.0s/5m00.0s
time="2025-06-12T17:59:47+09:00" level=info msg="Test completed in 300.157 seconds" source=console
time="2025-06-12T17:59:47+09:00" level=info msg="RSP Load Test finished" source=console


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.1' rate=0.00%

    http_req_duration
    ✓ 'p(95)<1000' p(95)=3.96ms


  █ TOTAL RESULTS 

    checks_total.......................: 49242   164.051147/s
    checks_succeeded...................: 100.00% 49242 out of 49242
    checks_failed......................: 0.00%   0 out of 49242

    ✓ register_euicc_status_200
    ✓ register_euicc_response_time_ok
    ✓ register_euicc_has_psk
    ✓ create_isdp_status_200
    ✓ create_isdp_response_time_ok
    ✓ create_isdp_has_aid
    ✓ key_establishment_status_200
    ✓ key_establishment_response_time_ok
    ✓ key_establishment_success
    ✓ prepare_profile_status_200
    ✓ prepare_profile_response_time_ok
    ✓ prepare_profile_success
    ✓ install_profile_status_200
    ✓ install_profile_response_time_ok
    ✓ install_profile_success
    ✓ status_check_200
    ✓ status_check_response_time_ok
    ✓ status_check_active

    CUSTOM
    errors..................................................................: 0.00%  0 out of 16414
    operations_completed....................................................: 17997  59.957526/s
    response_time...........................................................: min=0.191861 avg=1.81042   med=1.660918 max=15.247328 p(90)=2.960418 p(95)=4.252955 p(99)=6.505574
    rsp_operation_duration..................................................: min=0        avg=38.508863 med=2        max=426       p(90)=7        p(95)=414      p(99)=417     

    HTTP
    http_req_duration.......................................................: min=0.19ms   avg=1.79ms    med=1.68ms   max=15.25ms   p(90)=2.79ms   p(95)=3.96ms   p(99)=6.26ms  
      { expected_response:true }............................................: min=0.19ms   avg=1.79ms    med=1.68ms   max=15.25ms   p(90)=2.79ms   p(95)=3.96ms   p(99)=6.26ms  
    http_req_failed.........................................................: 0.00%  0 out of 19596
    http_reqs...............................................................: 19596  65.284641/s

    EXECUTION
    iteration_duration......................................................: min=205.12ms avg=508.00ms  med=505.69ms max=921.64ms  p(90)=774.95ms p(95)=840.09ms p(99)=898.38ms
    iterations..............................................................: 5294   17.637114/s
    vus.....................................................................: 1      min=1          max=15
    vus_max.................................................................: 15     min=15         max=15

    NETWORK
    data_received...........................................................: 6.5 MB 22 kB/s
    data_sent...............................................................: 4.6 MB 15 kB/s



running (5m00.2s), 00/15 VUs, 5294 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/15 VUs  5m0s